create table menu(					/*创建菜品表*/
	id int(10) primary key auto_increment,		/*菜品编号*/
	cname varchar(50),				/*菜品名称*/
	uid varchar(10),				/*菜品上传者*/
	primarypic varchar(50),				/*菜品主图*/
	style varchar(20),				/*菜系*/
	difficulty varchar(20),				/*困难度*/
	flavour varchar(20),				/*菜品口味*/
	ctime varchar(20),				/*菜品制作时间*/
	tools varchar(20),				/*厨具*/
	craft varchar(20),				/*制作工艺*/
	food varchar(1000),				/*主料*/
	codiments varchar(1000),			/*配料*/
	introduction varchar(1000),			/*菜品简介*/
	tips varchar(1000),				/*菜品提示*/
	slike int(5) default 0,			/*制作技巧*/
	collection int(5) default 0,			/*喜好菜品的人数*/
	pinglun int(5) default 0,			/*评论菜品的人数*/
	uploadtime timestamp default current_timestamp,	/*菜品上传时间*/
	likeuser varchar(1000) default '<#>',		/*喜好菜品的用户*/
	state tinyint(4) default 1,			/*菜品状态*/
	sculpture varchar(50) not null   		/*上传者头像*/
);
insert into menu values ('1021', '唯美黑森林', '张三', '1432555680984.jpeg', '其它', '大神级', '原味', '10分钟', '电烤箱', '其它', '可可戚蛋糕|一个%淡奶油|600克%黑巧克力|100克', '樱桃|60克%樱桃酒|80克', '为了这黑森林，做了不少的功课，第一次做给大家吃，没想到反响非常的好，之前的努力也就值得了！', '注意烘烤时间，时间太长奶油容易化掉，蛋糕会变形哦。', '1', '1', '2', '2015-05-25 20:08:01', '<#>张三<#>', '1', 'initial.jpg');
insert into menu values ('1022', '秘汁菠菜', '张三', '1432556874283.jpeg', '创意菜', '简单', '咸鲜', '20分钟', '汤锅', '拌', '菠菜|一小捆%植物油|少半碗', '花椒|一小撮%大料|2个%葱段|4小段%姜片|4小片%蒜孜然粒|半小把%生抽|适量%米醋|适量%鸡精|少许%盐|适量%蒜末|4-5瓣', '夏季最受欢迎的莫过于凉拌菜了！宝妈家的这道凉拌菠菜稍稍加了一点小心思，口味马上不同！这里的凉拌油适合好多蔬菜，且做法简单，零厨艺也轻松搞定!', '1 料油里的孜然量稍多些，这个油适合绝大多数凉拌菜 \n2 菠菜别焯太烂，一拌就成泥了 \n3 拌菜的时候，蒜末量大些', '2', '2', '1', '2015-05-25 20:27:54', '<#>张三<#>angle<#>', '1', 'initial.jpg');
insert into menu values ('1023', '泰式虾尖', '张三', '1432558038419.jpeg', '创意菜', '简单', '咸甜', '10分钟', '汤锅', '煮', '虾尖|适量%生菜|适量%鱼露|适量%芫荽|一棵%小辣椒|适量', '芒果|适量%紫椰菜|适量%糖|适量%柠檬|一颗%老抽|少许', '泰式沙拉和平时在西餐里吃到的甜味沙拉不太一样，混合着甜酸辣集中口味，又点奇怪却让人吃得停不下来！对比起加了大量糖和奶油的沙拉酱，这款绝对是低热量的沙拉。丰富的色彩，也让人胃口大开！', '1、如果喜欢西柚或者花生米的亲，也可以一起加入哦！\n2、由于沙拉属于生食，建议购买有机的蔬菜', '1', '1', '0', '2015-05-25 20:47:18', '<#>angle<#>', '1', 'initial.jpg');
insert into menu values ('1024', '凉拌青丝瓜', '张三', '1432559076962.jpeg', '创意菜', '简单', '咸鲜', '10分钟', '汤锅', '拌', '青瓜|1条%莴笋|100克%红萝卜|100克%豆腐皮|1块%盐|4块%酱油|30ml%香油|10ml%辣椒油|15ml', '香醋|10ml%白糖|2克', '炎炎夏日，清凉的夏日菜来啦。', '汁料可根据个人口味调整，也可加入辣椒葱香菜等等。', '3', '3', '0', '2015-05-25 21:04:36', '<#>张三<#>李志红<#>angle<#>', '1', 'initial.jpg');
insert into menu values ('1030', '红油猪儿', '张三', '1432562899389.jpeg', '家常菜式', '普通', '咸鲜', '数小时', '焖烧锅', '卤', '猪耳朵|2个%五花肉|1块%黄瓜|2个', '葱姜蒜|适量%白酒|适量%酱油|适量%辣椒油|适量%香叶|适量%干红辣椒|适量%甘草|适量%丁香|适量%八角|适量%草果|适量%盐|适量%酱油|适量%桂皮|适量%小茴香|适量%花椒|适量', '立夏后温度开始升起来，也越来越没了胃口，因此做点荤素搭配的开胃凉拌菜来调动家人的胃口。红油猪耳，很经典的一款凉菜，开胃、美味、简单，是道佐酒下饭的佳肴。虽说奶奶的手艺没有传下来，但还是有个小小的秘诀，就是制作素菜、牛肉等其它卤货时一定要加点五花肉，让它们都带有肉香，这样做出来能不好吃吗？ 提前将猪耳卤制好，卤好的猪耳最好泡上几个小时让它更入味。吃时将猪耳斜切成薄片，再刨些黄瓜片摆放在周围，倒入自制的红油，这样一盘美味的“红油猪耳”就完成了。猪耳吃起来香脆可口、酱香浓郁，非常有韧劲，再加上清香爽脆的黄瓜片，味道鲜香不腻人。', '1. 卤制猪耳准备的大料有：葱姜段， 八角、桂皮、香叶、花椒、干辣椒、甘草、草果、丁香和小茴香等，将它们放入调味料钢球中能保持卤水的干净； \n2. 猪耳和五花肉提前泡水或者焯水，卤制时加入白酒去腥，水开后撇去浮沫能更大限度保持鲜味； 煮开后转为小火， 煮上30分钟后猪耳八、九层熟， 再加入盐，最后煮上10分钟； 关火，泡上几个小时， 更加入味； \n3. 平时卤鸡鸭或者鸡杂、素菜等没有大油的食材， 加入块五花肉一起卤煮，味道更香；卤水可以捞出材料， 煮开后放入冰箱中冷冻， 下次接着使用， 到时候还可以添加点大料继续卤菜。', '2', '2', '0', '2015-05-25 22:08:19', '<#>张三<#>angle<#>', '1', 'initial.jpg');
insert into menu values ('1031', '洋葱虾仁', '张三', '1432647418980.jpeg', '家常菜式', '简单', '咸鲜', '20分钟', '炒锅', '炒', '明虾|250克%洋葱|1个', '青蒜|适量%细盐|适量%色拉油|适量', '现在我们这边明虾小菜场40，大菜场35。我上周六的时候去菜场买了三斤100元。买回家一小袋一小袋分好，在早上给家人做速炒类的菜，即快又有营养。喜欢的朋友们也可以参考一下哦。', '虾仁是易熟的食材，注意炒制的时间。', '0', '0', '0', '2015-05-26 21:36:58', '<#>', '1', 'initial.jpg');
insert into menu values ('1032', '橄榄油拌樱桃小胡萝卜', '张三', '1432648049953.jpeg', '家常菜式', '简单', '酸甜', '20分钟', '其他', '炒', '樱桃萝卜|150g%橄榄油|5g', '盐|适量%鲜酱油|5g%陈醋|5g%糖|3g%大蒜|2瓣%花椒油|少许', '樱桃萝卜外形袖珍，与樱桃很相似，看上去非常可爱，营养价值也颇高。 樱桃萝卜水分含量较高，品质细嫩，非常适合于生吃。今天做的这道凉菜口感特别脆嫩，也非常入味，是一道开胃下饭的小凉菜哦。', '1、萝卜在拍的时候别太用力，否则拍得太碎影响卖相，食用时也不好挟 \n2、萝卜如果腌出水来，在拌调料前要先控干水分', '3', '3', '1', '2015-05-26 21:47:29', '<#>李志红<#>李四<#>angle<#>', '1', 'initial.jpg');
insert into menu values ('1033', '红烧素鸡', '张三', '1432648803037.jpeg', '家常菜式', '普通', '咸鲜', '半个小时', '其他', '烧', '素鸡|350克', '油|适量%生姜|适量%香葱|1根%干辣椒|1个%八角|2个%冰糖|8g%馅酱油|10g%老抽|5g%耗油|10g', '素鸡是豆制品的一种，较有韧性，口感与肉类相似，适合于各种烹饪方式。 素鸡中含有丰富蛋白质和卵磷脂，可防止血管硬化、预防心血管疾病、保护心脏、促进骨骼发育的功效。 今天这道菜也是我初次制作，之前都是用来凉拌、炒着吃，味道都不错，不过用来红烧更有肉的味道，入口汁多香浓，非常美味。', '1、素鸡有大有小，我买的是大点的。所以一根就够了\n2、烧素鸡的水量可以多放点，因为素鸡在烧制的时候会吸掉许多汤汁，我开始放的水比较少，在烧的期间又续过水', '1', '0', '0', '2015-05-26 22:00:03', '<#>angle<#>', '1', 'initial.jpg');
insert into menu values ('1034', '凉拌木耳', '张三', '1432649604819.jpeg', '家常菜式', '普通', '超辣', '20分钟', '其他', '拌', '干木耳|50g%橄榄油|一勺', '红辣椒|5个%青辣椒|3个%大蒜|3瓣%白糖|一勺%生抽|2勺%辣椒油|一勺%鸡精|5g%陈醋|半勺', '最近我是一个木耳控。自从上次买了一包放着忘记了然后长虫了扔掉之后。我又去买了一包很大的。上班不想去买菜。天天就围着这个木耳吃。不管带饭还是在家，都是吃木耳。这东西就是好。不用切不用搞。只要泡发后洗净去蒂就行。这几天都是吃木耳炒肉。一大包今天也见底了。才想着我没有用来凉拌过。可能我弄的辣椒太多了。这辣椒又辣。爽口的不得了。任谁都拒绝不了。以前凉拌都是用普通的油。这次有幸得到了橄榄油的试用。这道菜加了橄榄油之后。味道大大的提升了很多。橄榄油是非常有营养的。用来凉拌什么的是最好的选择哦。', '用越小的木耳越好。油可以根据自己喜欢加香油。', '1', '1', '0', '2015-05-26 22:13:24', '<#>angle<#>', '1', 'initial.jpg');
insert into menu values ('1035', '京味儿烤羊肉', '张三', '1432650729708.jpeg', '家常菜式', '普通', '麻辣', '20分钟', '其他', '炒', '羊肉|300克', '腐乳汁|20g%鱼露|10克%酱油|5g%香菜|40g%葱|30g%姜|5g%香油|5g', '那天看食全食美，石万荣石大侠教做一道京味儿烤羊肉，我一看就眼馋想做了，这道菜用油很少，非常符合现在的少油少盐的健康理念，又解馋又健康。有兴趣的都试试看吧！', '1用筷子扒拉羊肉更容易将羊肉分散开。 \n2加完葱和香菜梗扒拉几下就出锅，久了口感不好。 \n3腌制羊肉时间不要过久，不然肉容易老。', '2', '2', '0', '2015-05-26 22:32:09', '<#>李四<#>angle<#>', '1', 'initial.jpg');
insert into menu values ('1036', '红烧小鱼野', '张三', '1432651493599.jpeg', '家常菜式', '普通', '中辣', '半个小时', '炒锅', '烧', '小白鱼|5个%泡椒|2勺', '葱|2棵%姜片|3个%蒜瓣|4个%生抽|1勺%胡椒粉|1勺', '福州本地不论是池塘或水库，很多很多这种浮游在水面上的小鱼，它们成群结队地游来游去；我实在不能准确的用普通话翻译出它的名称，且叫它小野鱼吧！ 星期天带着两个孩子去水库钓鱼，整整一上午，除了煮的这几条，大概还有10来条用盐腌着，准备晒干做成小鱼干。 虽然没钓到大鱼，不过已很知足，因为孩子们很开心………… 这种野鱼，虽然刺很多，但出奇的香；煎的酥酥的，再配上泡椒来焖；这时，米饭很无辜！', '', '3', '3', '8', '2015-05-26 22:44:53', '<#>李志红<#>李四<#>angle<#>', '1', 'initial.jpg');
insert into menu values ('1037', '黑芝麻蛋白薄脆饼', 'angle', '1432654677144.jpeg', '上海菜', '简单', '甜味', '一个小时', '其他', '技巧', '低筋面粉|50g%黄油|50g%蛋清|一个', '糖粉|40g%黑芝麻|适量', '这是一款非常好吃的饼干——芝麻香、饼干脆，口感一流，真正嘎嘣脆！制作过程简单，即便是新手做起来成功率也很高。还可以消耗掉平常做烘焙剩余的蛋清，减少食材的浪费，超赞！', '1面糊得够薄，烤出来的才脆饼干才脆。\n2本文中的烘烤箱温度仅供参考，实际根据自家烤箱温度进行调节。', '0', '0', '0', '2015-05-26 23:37:57', '<#>', '0', '1432652707868.jpeg');
insert into menu values ('1038', '川氏烤鱼', 'angle', '1432657309290.jpeg', '川菜', '简单', '麻辣', '数小时', '其他', '炒', '草鱼|900克%香芹|50克%青笋|50克%鲜香菇|20克%黄豆芽|20克%洋葱|10克%香菜|适量', '干辣椒|10克%干花椒|10克%郫县豆瓣酱|100克%料酒|10克%盐|2克%生姜|5克%大蒜|5克%孜然|20克%辣椒粉|5克%花椒粉|2克', '川氏烤鱼是一种发源于重庆，而被万州发扬光大的特色美食，流传过程中，融合腌、烤、炖三种烹饪工艺技术，充分借鉴啦传统川菜及川味火锅用料的特点，口味死奇绝，营养丰富', '', '0', '0', '0', '2015-05-27 00:21:50', '<#>', '0', '1432652707868.jpeg');


